In [1]:
#Ques 1
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

In [2]:
b()

In [3]:
b()

In [4]:
b()

In [5]:
a

6

In [7]:
#Ques 2
import os
def fileLength(filename):
  try:
    x = os.stat(filename)
    print(x.st_size)
  except IOError:
    print("File "+str(filename)+" not found")
    
fileLength('Untitled9.ipynb')
fileLength('idterm.py')

7704
File idterm.py not found

In [8]:
#Ques 3
class Marsupial:   
    def __init__(self):
        
        self.pouch=[]
    
    def put_in_pouch(self, item):
        self.pouch=self.pouch+[item]
   

    def pouch_contents(self):
        return self.pouch
 
m = Marsupial()
m.put_in_pouch("doll")
m.put_in_pouch("firetruck")
m.put_in_pouch("kitten")
print(m.pouch_contents()) 

#Part 2
class Kangaroo(Marsupial): 
    
    def __init__(self,x,y): 
        Marsupial.__init__(self)
        self.x = x
        self.y = y
        
    def jump(self,dx,dy):
        self.x += dx
        self.y += dy
   
    def __str__(self): 
        return 'I am a Kangaroo located at coordinates ({},{})'.format(self.x,self.y)


k = Kangaroo(0,0)
print(k)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

In [9]:
#Ques 4
def collatz(i):
    print(i)
    if i == 1:
        return 
    elif i % 2 == 0:
        return collatz(i//2)  
    else:
        return collatz(i*3+1)     
collatz(1)
collatz(10)

1
10
5
16
8
4
2
1

In [10]:
#Ques 5
def binary(num):
    if num == 0:
        return '0'
    else:
       x = ''
       while num > 0:
           x = str((num % 2)) + x
           num //= 2 
    return x
print(binary(0))
print(binary(1))
print(binary(3))
print(binary(9))

0
1
11
1001

In [ ]:
#ques 6  and ques 7 did not understood properly. Hence I did not did that.

In [11]:
#Ques 8 
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\shubh\anaconda3\lib\site-packages (0.4.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\shubh\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\shubh\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\shubh\anaconda3\lib\site-packages (from ipython-sql) (1.4.32)
Requirement already satisfied: sqlparse in c:\users\shubh\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: ipython>=1.0 in c:\users\shubh\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: six in c:\users\shubh\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: traitlets>=5 in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (61.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: pickleshare in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: jedi>=0.16 in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: backcall in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: pygments>=2.4.0 in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\shubh\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\shubh\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\shubh\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\shubh\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: pure-eval in c:\users\shubh\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\shubh\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\shubh\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)

In [12]:
%load_ext sql
%sql sqlite:///

In [13]:
%%sql
CREATE TABLE Weather(
    city varchar(30),
    country varchar(40),
    season varchar(50),
    temperature float(20),
    rainfall  float(30)
);

 * sqlite:///
Done.

[]

In [14]:
%%sql
INSERT INTO WEATHER VALUES
('Mumbai','India', 'winter','24.8','5.9'),
('Mumbai','India', 'spring','28.4','16.2'),
('Mumbai','India', 'summer','27.9','1549.4'),
('Mumbai','India', 'fall','27.6','346.0'),
('London','United Kingdom','winter','4.2','207.7'),
('London','United Kingdom','sping','8.3','169.6'),
('London','United Kingdom','summer','15.7','157.0'),
('London','United Kingdom','fall','10.4','218.5'),
('Cairo','Egypt', 'winter','13.6','16.5'),
('Cairo','Egypt', 'spring','20.7','6.5'),
('Cairo','Egypt', 'summer','27.7','0.1'),
('Cairo','Egypt', 'fall','22.2','4.5'
);

 * sqlite:///
12 rows affected.

[]

In [15]:
%sql select * from Weather;

 * sqlite:///
Done.

[('Mumbai', 'India', 'winter', 24.8, 5.9),
 ('Mumbai', 'India', 'spring', 28.4, 16.2),
 ('Mumbai', 'India', 'summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'sping', 8.3, 169.6),
 ('London', 'United Kingdom', 'summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'fall', 22.2, 4.5)]

In [16]:
%sql select temperature from Weather;

 * sqlite:///
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [17]:
%sql select distinct city from Weather;

 * sqlite:///
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [18]:
%sql select * from Weather where country = 'India';

 * sqlite:///
Done.

[('Mumbai', 'India', 'winter', 24.8, 5.9),
 ('Mumbai', 'India', 'spring', 28.4, 16.2),
 ('Mumbai', 'India', 'summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'fall', 27.6, 346.0)]

In [19]:
%sql select * from Weather where season ='fall';

 * sqlite:///
Done.

[('Mumbai', 'India', 'fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'fall', 22.2, 4.5)]

In [20]:
%sql select City, country, season from Weather where rainfall > 200 AND rainfall < 400;

 * sqlite:///
Done.

[('Mumbai', 'India', 'fall'),
 ('London', 'United Kingdom', 'winter'),
 ('London', 'United Kingdom', 'fall')]

In [21]:
%sql select city, country from Weather where season = 'fall' And temperature > 20 ORDER BY temperature;

 * sqlite:///
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [22]:
%sql select sum(rainfall) from Weather where city = 'Cairo';

 * sqlite:///
Done.

[(27.6,)]

In [23]:
%sql select sum(rainfall) from Weather group by season;

 * sqlite:///
Done.

[(569.0,), (169.6,), (22.7,), (1706.5,), (230.1,)]

In [24]:
#Ques 9a
def Upper(words):  
    for s in range(len(words)): 
        words[s] = words[s].upper()

    return words

words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
list_Upper = Upper(words)
print(list_Upper)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [25]:
#Ques 9b
def Lower(words): 
    for s in range(len(words)): 
        words[s] = words[s].lower()

    return words
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
list_Lower = Lower(words)
print(list_Lower)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [26]:
#Ques 9c
def Length(words):
    for s in range(len(words)):  
        words[s] = len(words[s])

    return words


words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
list_Length=Length(words)
print(list_Length)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [28]:
#Ques 9d
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

words_data_list = []

for element in words:
    word_data = [element.upper(),element.lower(),len(element)]
    words_data_list.append(word_data)
print(f"Output List: {words_data_list}")

Output List: [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

In [27]:
#Ques 9e
def X_4(words):
    list = []
    for s in range(len(words)):
        if len(words[s]) >= 4:          
            list.append(words[s])

    return list


words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

list = X_4(words)
print(list)

['quick', 'brown', 'jumps', 'over', 'lazy']